In [1]:
import pandas as pd
import seaborn as sns

In [5]:
df['color'].value_counts()

color
yellow    5451
green      982
Name: count, dtype: int64

In [7]:
df['payment'].unique()

array(['credit card', 'cash', nan], dtype=object)

In [9]:
df['payment'].value_counts()

payment
credit card    4577
cash           1812
Name: count, dtype: int64

In [11]:
df['color'].unique()

array(['yellow', 'green'], dtype=object)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6433 entries, 0 to 6432
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6433 non-null   datetime64[ns]
 1   dropoff          6433 non-null   datetime64[ns]
 2   passengers       6433 non-null   int64
 3   distance         6433 non-null   float64
 4   fare             6433 non-null   float64
 5   tip              6433 non-null   float64
 6   tolls            6433 non-null   float64
 7   total            6433 non-null   float64
 8   color            6433 non-null   object
 9   payment          6389 non-null   object
 10  pickup_zone      6407 non-null   object
 11  dropoff_zone     6388 non-null   object
 12  pickup_borough   6407 non-null   object
 13  dropoff_borough  6388 non-null   object
dtypes: datetime64[ns](2), float64(5), int64(1), object(6)
memory usage: 703.7+ KB

In [25]:
df.iloc[2]

pickup             2019-03-27 17:53:01
dropoff            2019-03-27 18:00:25
passengers                           1
distance                          1.37
fare                               7.5
tip                               2.36
tolls                              0.0
total                            14.16
color                           yellow
payment                    credit card
pickup_zone              Alphabet City
dropoff_zone              West Village
pickup_borough               Manhattan
dropoff_borough              Manhattan
Name: 2, dtype: object

In [17]:
import numpy as np

In [19]:
a=pd.Series(['India',5,2,8,4,9])

In [21]:
a

0    India
1        5
2        2
3        8
4        4
5        9
dtype: object

In [27]:
df.iloc[2:10]

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan
5,2019-03-11 10:37:23,2019-03-11 10:47:31,1,0.49,7.5,2.16,0.0,12.96,yellow,credit card,Times Sq/Theatre District,Midtown East,Manhattan,Manhattan
6,2019-03-26 21:07:31,2019-03-26 21:17:29,1,3.65,13.0,2.00,0.0,18.80,yellow,credit card,Battery Park City,Two Bridges/Seward Park,Manhattan,Manhattan
7,2019-03-22 12:47:13,2019-03-22 12:58:17,0,1.40,8.5,0.00,0.0,11.80,yellow,NaN,Murray Hill,Flatiron,Manhattan,Manhattan
8,2019-03-23 11:48:50,2019-03-23 12:06:14,1,3.63,15.0,1.00,0.0,19.30,yellow,credit card,East Harlem South,Midtown Center,Manhattan,Manhattan
9,2019-03-08 16:18:37,2019-03-08 16:26:57,1,1.52,8.0,1.00,0.0,13.30,yellow,credit card,Lincoln Square East,Central Park,Manhattan,Manhattan

In [32]:
df.iloc[3:4]

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.7,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan

In [38]:
df.iloc[2:10,6:10]

   tolls  total   color      payment
2    0.0  14.16  yellow  credit card
3    0.0  36.95  yellow  credit card
4    0.0  13.40  yellow  credit card
5    0.0  12.96  yellow  credit card
6    0.0  18.80  yellow  credit card
7    0.0  11.80  yellow          NaN
8    0.0  19.30  yellow  credit card
9    0.0  13.30  yellow  credit card

In [40]:
df.iloc[2:10,7:10]

   total   color      payment
2  14.16  yellow  credit card
3  36.95  yellow  credit card
4  13.40  yellow  credit card
5  12.96  yellow  credit card
6  18.80  yellow  credit card
7  11.80  yellow          NaN
8  19.30  yellow  credit card
9  13.30  yellow  credit card

In [46]:
df.loc[2:10,['distance','total']]

    distance  total
2       1.37  14.16
3       7.70  36.95
4       2.16  13.40
5       0.49  12.96
6       3.65  18.80
7       1.40  11.80
8       3.63  19.30
9       1.52  13.30
10      3.90  17.80

In [48]:
df.loc[2:10,['distance','total',''pyment']]

SyntaxError: unterminated string literal (detected at line 1) (962312495.py, line 1)